app/Controllers/Main.php

    public function process($mode)
    {
        switch ($mode) {

            case 'changeheader': {

                    $header = new \App\Models\headerdb();
                    $title = $this->request->getPost('editor');
                    $header->save([
                        'header' => $title

                    ]);
---
INSERT INTO `headers` (`header`) VALUES ('rodri')